In [1]:
import plotly.graph_objects as go
import pandas as pd

In [2]:
df = pd.read_csv("sample_data.csv")
df

    merchant_size    division                   category       amount  count
0           Small      Khulna        Eating and Drinking   3115535.84   1364
1          Medium  Chittagong        Eating and Drinking   7461742.72   2020
2          Medium      Khulna                 Automotive   3592350.80    748
3          Medium       Dhaka        Eating and Drinking  23872376.34   6440
4          Medium       Dhaka  Cell Phones & Accessories  66248767.03  12678
..            ...         ...                        ...          ...    ...
309        Medium  Chittagong       Unstructure Merchant         1.06      1
310         Large     Barisal                 Automotive        50.00      1
311           POS       Dhaka         Leather & Clothing         1.00      1
312         Small     Barisal             Sports & Music      3650.00      2
313         Large    Rajshahi             Home & Kitchen        50.00      1

[314 rows x 5 columns]

In [3]:
df.merchant_size.unique()

array(['Small', 'Medium', 'Large', 'Micro', 'Elite', 'Unknown', 'POS'],
      dtype=object)

In [5]:
size= 'Small'
cat = 'Eating and Drinking'
graph_data = df[(df['merchant_size']==size) & (df['category']==cat)]

In [6]:
graph_data

    merchant_size    division             category      amount  count
0           Small      Khulna  Eating and Drinking  3115535.84   1364
7           Small       Dhaka  Eating and Drinking  9148757.80  11166
24          Small      Sylhet  Eating and Drinking    10441.55     38
48          Small     Barisal  Eating and Drinking   659484.07    359
70          Small  Chittagong  Eating and Drinking  1678577.81    383
189         Small    Rajshahi  Eating and Drinking   219292.04     61

In [7]:
graph_data['division']

0          Khulna
7           Dhaka
24         Sylhet
48        Barisal
70     Chittagong
189      Rajshahi
Name: division, dtype: object

In [8]:
graph_data['amount']

0      3115535.84
7      9148757.80
24       10441.55
48      659484.07
70     1678577.81
189     219292.04
Name: amount, dtype: float64

In [11]:
graph_data['amount'].sum()

14832089.110000001

In [12]:
graph_data['count'].sum()

13371